app/Controllers/tambah_absen.php

SELECT *
FROM `data_gaji`
SELECT *
FROM `data_potongan`
---
    public function index()
    {
        // $data['data_absen']=$this->User->getDataAbsen();
        // return view('master_absen/tambah_absen',$data);

        // $model = new GajiModel();
		// $data = $model->findAll();

        $model = new GajiModel();
        $data['data_gaji'] = $model->findAll();

        $model2 = new PotonganModel();
        $data['data_potongan'] = $model2->findAll();

SELECT *
FROM `data_gaji`
SELECT *
FROM `data_potongan`
---
    public function ubah($id)
    {


        // $model = new AbsensiModel();
        // $data=$model->getDataAbsen($id);
        // return view('ubah_absen/index',['data_absen' => $data]);



//         $db      = \Config\Database::connect();
// $builder = $db->table('data_gaji');
// $data_gaji   = $builder->get();  // Produces: SELECT * FROM mytable

// foreach ($data_gaji->getResult() as $baris)
// {
//         echo $baris->gaji;
// }
// return view('ubah_absen/index', ['data_absen' => $data_absen]);
// return view('ubah_absen/index',['data_gaji' => $data_gaji]);


// $modelabsen = new AbsensiModel();
$data_absen=$this->Absen->find($id);
$data['data_absen'] = $data_absen;

$model = new GajiModel();
$data['data_gaji'] = $model->findAll();

$model2 = new PotonganModel();
$data['data_potongan'] = $model2->findAll();