app/Models/AbsensiModel.php

SELECT *
FROM `data_absen`
---
    public function getDataAbsen($id = false)
    {
        if($id == false) {
            return $this->findAll();