app/Models/GajiModel.php

    public function getDataGaji($id = false)
    {
        if($id == false) {
            return $this->findAll();
---
SELECT *
FROM `data_gaji`