app/Models/PegawaiModel.php

    public function getDataPegawai($id = false)
    {
        if($id == false) {
            return $this->findAll();
        } else {
            return $this->where(['id_pegawai'=>$id]) -> first();
---
SELECT *
FROM `data_pegawai`
SELECT *
FROM `data_pegawai`
WHERE `id_pegawai` = '34'
 LIMIT 1