app/Models/PotonganModel.php

    public function getDataPotongan($id = false)
    {
        if($id == false) {
            return $this->findAll();
        } else {
            return $this->where(['id_potongan'=>$id]) -> first();
---
SELECT *
FROM `data_potongan`
WHERE `id_potongan` = 'css'
 LIMIT 1