app/Models/SlipGajiModel.php

    public function getDataSlipGaji($id = false)
    {
        if($id == false) {
            return $this->findAll();
        } else {
            return $this->where(['id_data_absen'=>$id]) -> first();
---
SELECT *
FROM `data_slip_gaji`
SELECT *
FROM `data_absen`
WHERE `id_data_absen` = '43'
 LIMIT 1